SURV/src/InformationRegisters/УчетРабочегоВремени/УчетРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетРабочегоВремени</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ВидВремени</name>
    <type>
      <types>EnumRef.ВидыВремени</types>
    </type>
  </resources>
  <resources>
    <name>ВремяОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Офис</name>
    <type>
      <types>CatalogRef.Офисы</types>
    </type>
  </resources>
  <resources>
    <name>ПользовательПодписант</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <attributes>
    <name>Дверь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SURV/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Домен</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Офис</name>
    <type>
      <types>CatalogRef.Офисы</types>
    </type>
  </attributes>
  <attributes>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.Отделы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонДобавочный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Родитель1</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель2</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель3</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель4</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель5</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель6</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель7</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель8</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Catalog>

SURV/src/InformationRegisters/УчетРабочегоВремени/Forms/ФормаКтоВОфисе/Module.bsl
&НаКлиенте
Процедура ОтборПоОфисуПриИзменении(Элемент)
	ИзменитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоСотрудникуПриИзменении(Элемент)
	ИзменитьОтбор();
КонецПроцедуры

&НаСервере
Процедура ИзменитьОтбор()
	ТекстЗапроса = ИсходныйЗапрос;//ЭтаФорма.Список.ТекстЗапроса;
	ПараметрыЗапроса = Новый Структура;
	Если ЗначениеЗаполнено(ЭтаФорма.ОтборПоОфису) Тогда 
		ТекстЗапроса = ТекстЗапроса + " 
		|	И УчетРабочегоВремениСрезПоследних.Офис = &Офис";
		ПараметрыЗапроса.Вставить("Офис",ЭтаФорма.ОтборПоОфису);
	КонецЕсли;
	Если ЗначениеЗаполнено(ЭтаФорма.ОтборПоСотруднику) Тогда 
		ТекстЗапроса = ТекстЗапроса + " 
		|	И УчетРабочегоВремениСрезПоследних.Пользователь = &Пользователь";
		ПараметрыЗапроса.Вставить("Пользователь",ЭтаФорма.ОтборПоСотруднику);
	КонецЕсли;
	Если Элементы.ТолькоСотрудники.Пометка Тогда 
		ТекстЗапроса = ТекстЗапроса + " 
		|	И УчетРабочегоВремениСрезПоследних.Пользователь.Email ПОДОБНО ""%@%""";
		//ПараметрыЗапроса.Вставить("ТолькоСотрудники",Истина);
	КонецЕсли;
	УстановитьЗапросСписка(ТекстЗапроса,ПараметрыЗапроса);	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИсходныйЗапрос = ПолучитьЗапросСписка();
	ИзменитьОтбор();
КонецПроцедуры

&НаСервере
Функция ПолучитьЗапросСписка()
	Возврат Список.ТекстЗапроса;	
КонецФункции

&НаСервере
Процедура УстановитьЗапросСписка(ТекстЗапроса,ПараметрыЗапроса = Неопределено)
	Если ПараметрыЗапроса <> Неопределено Тогда 
		Для Каждого Эл Из ПараметрыЗапроса Цикл 
			Список.Параметры.УстановитьЗначениеПараметра(Эл.Ключ,Эл.Значение);
		КонецЦикла;
	КонецЕсли;
	Если Список.Группировка.Элементы.Количество() > 0 Тогда 
		Список.Группировка.Элементы[1].Использование = Элементы.ПоОтделам.Пометка;//группировка Отдел = 1
	КонецЕсли;
	Список.ТекстЗапроса = ТекстЗапроса;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ПараметрыСеанса.ТекущаяДата);                
	Список.Параметры.УстановитьЗначениеПараметра("ТекущийОфис", ПараметрыСеанса.ТекущийОфис);                
	Список.Параметры.УстановитьЗначениеПараметра("Офис", Справочники.Офисы.ПустаяСсылка());                
	Список.Параметры.УстановитьЗначениеПараметра("Пользователь", Справочники.Пользователи.ПустаяСсылка());                
	Элементы.Список.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;//.НеРаскрывать;
	ЭтаФорма.ОтборПоОфису = ПараметрыСеанса.ТекущийОфис;
	ПроверитьУстановитьСмещениеВремениДляофиса();
КонецПроцедуры

&НаСервере
Процедура ПроверитьУстановитьСмещениеВремениДляофиса()
	ТекОфис = ПараметрыСеанса.ТекущийОфис;
	Если ЗначениеЗаполнено(ТекОфис) Тогда 
		РазностьВремени = Час(ВернутьТекущуюДатуСеанса())-Час(ТекущаяДата());
		Если РазностьВремени <> 0 Тогда 
			Если ТекОфис.ОтклонениеВремениВЧасах <> РазностьВремени Тогда 
				УстановитьПривилегированныйРежим(Истина);
				Об = ТекОфис.ПолучитьОбъект();
				Об.ОтклонениеВремениВЧасах = РазностьВремени;
				Об.Записать();
				УстановитьПривилегированныйРежим(Ложь);
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	////Если Элементы.Список.Развернут(Элементы.Список.ТекущаяСтрока) Тогда
	////	Элементы.Список.Свернуть(Элементы.Список.ТекущаяСтрока);
	////Иначе
	////    Элементы.Список.Развернуть(Элементы.Список.ТекущаяСтрока);
	////КонецЕсли;
	//ТекСтрока = Элементы.Список.ТекущаяСтрока;
	//Если ТекСтрока <> Неопределено Тогда 
	//	Элементы.Список.Развернуть(ТекСтрока);
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтработанноеВремя(Команда)
	ОткрытьФорму("Отчет.ОтработанноеВремя.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ПоОтделам(Команда)
	Элементы.ПоОтделам.Пометка = Не Элементы.ПоОтделам.Пометка;
	ИзменитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ОшибкиУчета(Команда)
	ОткрытьФорму("Отчет.ОшибкиУчетаРабочегоВремени.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ТолькоСотрудники(Команда)
	Элементы.ТолькоСотрудники.Пометка = Не Элементы.ТолькоСотрудники.Пометка;
	ИзменитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ИсторияПоСотруднику(Команда)
	ТекПользователь = ПолучитьТекПользователя();
	Если ТекПользователь <> Неопределено Тогда 
		ОткрытьФорму("РегистрСведений.УчетРабочегоВремени.Форма.ФормаИсторияЗаПериод",Новый Структура("ОтборПоПользователю",ТекПользователь));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьТекПользователя()
	ТекСтрока = Элементы.Список.ТекущаяСтрока;
	Если ТекСтрока <> Неопределено Тогда
		СписокРеквизитов = Новый СписокЗначений;
		СписокРеквизитов.Добавить("Ссылка");
		СписокРеквизитов.Добавить("Пользователь");
		Для Каждого Эл Из СписокРеквизитов Цикл 
			Попытка
				Возврат ТекСтрока[эл.Значение];	
			Исключение
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура Обновить(Команда)
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура Тест(Команда)
	Сообщить(ВернутьТекущуюДатуСеанса());
	Сообщить(ТекущаяДата());
КонецПроцедуры

&НаСервере
Функция ВернутьТекущуюДатуСеанса()
	Возврат ТекущаяДатаСеанса();
КонецФункции

&НаКлиенте
Процедура ЗаявкиНаОтсутствие(Команда)
	ОткрытьФорму("Отчет.ЗаявкиОбОтсутствии.Форма");
КонецПроцедуры
